Test/Jerome_Test/ManageResourceInventory/IIS/xml/3-1_aft_getInventoryWithFileTransferRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/bw-2" xmlns:ft="http://www.tmforum.org/mtop/fmw/xsd/mepft/v1" xmlns:invr="http://www.tmforum.org/mtop/mri/xsd/rir/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/rir/v1 ../xsd/ResourceInventoryRetrievalMessagesV1-0.xsd 
http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:To>http://host:port/ServiceProvider</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/mri/wsdl/rir/v1-0/getInventoryWithFileTransferRequest</wsa:Action>
    <wsa:ReplyTo>
      <wsa:Address>http://host:port/ServiceConsumer</wsa:Address>
    </wsa:ReplyTo>
    <wsa:MessageID>http://host:port/operation3333</wsa:MessageID>
  </soap:Header>
  <soap:Body>
    <invr:getInventoryWithFileTransferRequest>
      <ft:fileLocationURI/>
      <ft:howMany>500</ft:howMany>
      <ft:compressionType>GZIP</ft:compressionType>
      <ft:packingType>ZIP</ft:packingType>
      <ft:notificationEpr>
        <wsa:Address>http://host:port/ServiceConsumer</wsa:Address>
        <wsa:PortType>wsnt:NotificationConsumer</wsa:PortType>
      </ft:notificationEpr>
      <invr:filter>
        <invr:baseInstance>
          <nam:object>
            <nam:type>mdNm</nam:type>
            <nam:name>string</nam:name>
          </nam:object>
        </invr:baseInstance>
        <invr:includedObjectType>
          <invr:objectType>ME</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
        <invr:includedObjectType>
          <invr:objectType>PTP</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
        <invr:includedObjectType>
          <invr:objectType>CTP</invr:objectType>
          <invr:granularity>ATTRS</invr:granularity>
        </invr:includedObjectType>
      </invr:filter>
    </invr:getInventoryWithFileTransferRequest>
  </soap:Body>
</soap:Envelope>
